DataProcessors/Renault_ОбновитьРегистрыАвтосервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ОбновитьРегистрыАвтосервиса</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_АвтосервисПланРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_АвтосервисПланРабот</Name>
			<Comment>Регистр хранения планов работ</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>versionID</Name>
					<Comment>Скрытый реквизит, автоматически генерирует номер версии при записи</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Очередность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>strID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаМойку</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ВыдачаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ПриемкаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_АвтосервисПростой</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_АвтосервисПрочаяЗанятость</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаПодменныйАвто</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_АвтосервисОбед</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_ПодменныеАвто</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_Мойки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Удалить_Авторабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_АвтосервисСтатусыРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_АвтосервисСтатусыРабот</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВремяИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СтатусыАвторабот</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипПаузы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_АвтосервисВидыПрочейЗанятости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаМойку</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ВыдачаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ПриемкаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_АвтосервисПростой</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_АвтосервисПрочаяЗанятость</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаПодменныйАвто</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_АвтосервисОбед</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_ПодменныеАвто</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_Мойки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Удалить_Авторабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_АвтосервисПланОперативный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_АвтосервисПланОперативный</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаМойку</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ВыдачаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ПриемкаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаПодменныйАвто</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_ПодменныеАвто</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_Мойки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Удалить_Авторабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_АвтосервисФактОперативный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_АвтосервисФактОперативный</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаМойку</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ВыдачаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ПриемкаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаПодменныйАвто</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_ПодменныеАвто</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_Мойки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Авторабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Renault_CRM_АвтосервисПростой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_CRM_АвтосервисПростой</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_Мойки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПростоя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаПростоя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Renault_CRM_АвтосервисОбед.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_CRM_АвтосервисОбед</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_Мойки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/Renault_ОбновитьРегистрыАвтосервиса/Ext/ObjectModule.bsl
Процедура ОбработкаНаСервере() Экспорт
	
	Renault_Лицензирование.ПроверитьНаличиеЛицензий();
	
	ОбновитьРегистрыАвтосервиса();
	// БурковскийМЕ от 18.37.19 {
	Обновить_DMS_АРМ_АВтосервис();
	// БурковскийМЕ от 18.37.19 }
	
	ОчиститьИзбыточныеДанные();
	
КонецПроцедуры

Процедура ОбновитьРегистрыАвтосервиса() Экспорт
	
	Период 			= ТекущаяДатаСеанса();
	ШагПланирования	= 60;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГрафикРаботАвтосервиса.Ссылка КАК ДилерскийЦентр,
		|	ГрафикРаботАвтосервиса.НачалоРабочегоДня КАК НачалоРабочегоДня,
		|	ГрафикРаботАвтосервиса.КонецРабочегоДня КАК КонецРабочегоДня
		|ПОМЕСТИТЬ ГрафикиРаботДилерскихЦентров
		|ИЗ
		|	Справочник.CRM_ДилерскиеЦентры.АвтосервисГрафикРабот КАК ГрафикРаботАвтосервиса
		|ГДЕ
		|	ГрафикРаботАвтосервиса.ДеньНедели = ДЕНЬНЕДЕЛИ(&Период)
		|	И НЕ ГрафикРаботАвтосервиса.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПланРаботАвтосервиса.ДилерскийЦентр КАК ДилерскийЦентр,
		|	ГрафикиРаботДилерскихЦентров.НачалоРабочегоДня КАК НачалоРабочегоДня,
		|	ГрафикиРаботДилерскихЦентров.КонецРабочегоДня КАК КонецРабочегоДня,
		|	ПланРаботАвтосервиса.РабочийДокумент КАК РабочийДокумент,
		|	ПланРаботАвтосервиса.Цех КАК Цех,
		|	ПланРаботАвтосервиса.ЭтапРабот КАК ЭтапРабот,
		|	ПланРаботАвтосервиса.ВремяНачала КАК ВремяНачала,
		|	ПланРаботАвтосервиса.ВремяОкончания КАК ВремяОкончания,
		|	ПланРаботАвтосервиса.Длительность КАК Длительность,
		|	СтатусыРаботАвтосервиса.СтатусРаботы КАК СтатусРаботы,
		|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ЧАС, ЧАС(ГрафикиРаботДилерскихЦентров.НачалоРабочегоДня)), МИНУТА, МИНУТА(ГрафикиРаботДилерскихЦентров.НачалоРабочегоДня)) КАК НачалоРабочегоДняДЦ,
		|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ЧАС, ЧАС(ГрафикиРаботДилерскихЦентров.КонецРабочегоДня)), МИНУТА, МИНУТА(ГрафикиРаботДилерскихЦентров.КонецРабочегоДня)) КАК КонецРабочегоДняДЦ,
		|	&Период КАК Период,
		|	ЕСТЬNULL(ПланРаботАвтосервиса.РабочийДокумент.Обращение, ЗНАЧЕНИЕ(Документ.Renault_CRM_ОбращениеВАвтоСервис.ПустаяСсылка)) КАК ОбращениеРабочийДокумент,
		|	ПланРаботАвтосервиса.ДилерскийЦентр.Автосервис_ИгнорироватьНезакрытуюВыдачу КАК ИгнорироватьНезакрытуюВыдачу,
		|	ПланРаботАвтосервиса.ДилерскийЦентр.Автосервис_НеДвигатьПросроченныеРаботы КАК НеДвигатьПросроченныеРаботы,
		|	ПланРаботАвтосервиса.ДилерскийЦентр.ДлительностьВыдачи КАК ДлительностьВыдачи,
		|	ПланРаботАвтосервиса.ДилерскийЦентр.Автосервис_ЗавершатьВыдачуЧерез КАК ЗавершатьВыдачуЧерез,
		|	ПланРаботАвтосервиса.ДилерскийЦентр.ДлительностьПриемки КАК ДлительностьПриемки,
		|	ПланРаботАвтосервиса.ДилерскийЦентр.Автосервис_ЗавершатьПриемкуЧерез КАК ЗавершатьПриемкуЧерез,
		|	ПланРаботАвтосервиса.Обращение КАК Обращение
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	РегистрСведений.Renault_АвтосервисПланРабот КАК ПланРаботАвтосервиса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГрафикиРаботДилерскихЦентров КАК ГрафикиРаботДилерскихЦентров
		|		ПО ПланРаботАвтосервиса.ДилерскийЦентр = ГрафикиРаботДилерскихЦентров.ДилерскийЦентр
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисСтатусыРабот.СрезПоследних(&Период, ) КАК СтатусыРаботАвтосервиса
		|		ПО ПланРаботАвтосервиса.ДилерскийЦентр = СтатусыРаботАвтосервиса.ДилерскийЦентр
		|			И ПланРаботАвтосервиса.РабочийДокумент = СтатусыРаботАвтосервиса.РабочийДокумент
		|			И ПланРаботАвтосервиса.Цех = СтатусыРаботАвтосервиса.Цех
		|			И ПланРаботАвтосервиса.ЭтапРабот = СтатусыРаботАвтосервиса.ЭтапРабот
		|			И (НЕ СтатусыРаботАвтосервиса.РабочийДокумент ССЫЛКА Документ.Renault_CRM_ЗаявкаНаПодменныйАвто)
		|			И (НЕ СтатусыРаботАвтосервиса.РабочийДокумент ССЫЛКА Документ.Renault_CRM_АвтосервисПростой)
		|			И (НЕ СтатусыРаботАвтосервиса.РабочийДокумент ССЫЛКА Документ.Renault_CRM_АвтосервисОбед)
		|			И (НЕ СтатусыРаботАвтосервиса.РабочийДокумент ССЫЛКА Документ.Renault_CRM_АвтосервисПрочаяЗанятость)
		|			И ПланРаботАвтосервиса.Обращение = СтатусыРаботАвтосервиса.Обращение
		|			И (ЕСТЬNULL(СтатусыРаботАвтосервиса.СтатусРаботы, ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.пустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаЗакончена))
		|			И (ЕСТЬNULL(СтатусыРаботАвтосервиса.СтатусРаботы, ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.пустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.ПустаяСсылка))
		|			И (ЕСТЬNULL(СтатусыРаботАвтосервиса.СтатусРаботы, ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.пустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаОбед))
		|			И (ЕСТЬNULL(СтатусыРаботАвтосервиса.СтатусРаботы, ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.пустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаПростой))
		|			И (ЕСТЬNULL(СтатусыРаботАвтосервиса.СтатусРаботы, ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.пустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаПрочаяЗанятость))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисПланОперативный.СрезПоследних(&Период, ) КАК ОперативныйПланАвтосервиса
		|		ПО ПланРаботАвтосервиса.ДилерскийЦентр = ОперативныйПланАвтосервиса.ДилерскийЦентр
		|			И ПланРаботАвтосервиса.Обращение = ОперативныйПланАвтосервиса.Обращение
		|			И ПланРаботАвтосервиса.РабочийДокумент = ОперативныйПланАвтосервиса.РабочийДокумент
		|			И ПланРаботАвтосервиса.ЭтапРабот = ОперативныйПланАвтосервиса.ЭтапРабот
		|			И ПланРаботАвтосервиса.Цех = ОперативныйПланАвтосервиса.Цех
		|ГДЕ
		|	ЕСТЬNULL(ОперативныйПланАвтосервиса.ВремяНачала, ПланРаботАвтосервиса.ВремяНачала) <= &Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ФактОперативныйАвтосервис.ВремяОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА РАЗНОСТЬДАТ(ФактОперативныйАвтосервис.ВремяНачала, &Период, СЕКУНДА)
		|			ИНАЧЕ РАЗНОСТЬДАТ(ФактОперативныйАвтосервис.ВремяНачала, ФактОперативныйАвтосервис.ВремяОкончания, СЕКУНДА)
		|		КОНЕЦ) КАК ФактВремени,
		|	ТаблицаДанных.ДилерскийЦентр КАК ДилерскийЦентр,
		|	ТаблицаДанных.РабочийДокумент КАК РабочийДокумент,
		|	ТаблицаДанных.Цех КАК Цех,
		|	ТаблицаДанных.ЭтапРабот КАК ЭтапРабот,
		|	ТаблицаДанных.Обращение КАК Обращение
		|ПОМЕСТИТЬ ФактическоеВремя
		|ИЗ
		|	ТаблицаДанных КАК ТаблицаДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисФактОперативный КАК ФактОперативныйАвтосервис
		|		ПО ТаблицаДанных.ДилерскийЦентр = ФактОперативныйАвтосервис.ДилерскийЦентр
		|			И ТаблицаДанных.РабочийДокумент = ФактОперативныйАвтосервис.РабочийДокумент
		|			И ТаблицаДанных.ЭтапРабот = ФактОперативныйАвтосервис.ЭтапРабот
		|			И ТаблицаДанных.Цех = ФактОперативныйАвтосервис.Цех
		|			И ТаблицаДанных.Обращение = ФактОперативныйАвтосервис.Обращение
		|			И (ТаблицаДанных.Период <= ТаблицаДанных.КонецРабочегоДняДЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДанных.ДилерскийЦентр,
		|	ТаблицаДанных.РабочийДокумент,
		|	ТаблицаДанных.Цех,
		|	ТаблицаДанных.ЭтапРабот,
		|	ТаблицаДанных.Обращение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДанных.ДилерскийЦентр,
		|	ТаблицаДанных.РабочийДокумент,
		|	ТаблицаДанных.Цех,
		|	ТаблицаДанных.ЭтапРабот,
		|	ТаблицаДанных.Обращение,
		|	ТаблицаДанных.СтатусРаботы,
		|	ТаблицаДанных.НачалоРабочегоДня,
		|	ТаблицаДанных.КонецРабочегоДня,
		|	ТаблицаДанных.ВремяНачала,
		|	ТаблицаДанных.ВремяОкончания,
		|	ТаблицаДанных.Длительность,
		|	ТаблицаДанных.НачалоРабочегоДняДЦ,
		|	ТаблицаДанных.КонецРабочегоДняДЦ,
		|	ТаблицаДанных.Период,
		|	ТаблицаДанных.ОбращениеРабочийДокумент,
		|	ТаблицаДанных.ИгнорироватьНезакрытуюВыдачу,
		|	ТаблицаДанных.НеДвигатьПросроченныеРаботы,
		|	ТаблицаДанных.ДлительностьВыдачи КАК ДлительностьВыдачи,
		|	ТаблицаДанных.ЗавершатьВыдачуЧерез КАК ЗавершатьВыдачуЧерез,
		|	ТаблицаДанных.ДлительностьПриемки КАК ДлительностьПриемки,
		|	ТаблицаДанных.ЗавершатьПриемкуЧерез КАК ЗавершатьПриемкуЧерез,
		|	ЕСТЬNULL(ФактическоеВремя.ФактВремени, 0) КАК ФактВремени
		|ИЗ
		|	ТаблицаДанных КАК ТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ ФактическоеВремя КАК ФактическоеВремя
		|		ПО ТаблицаДанных.ДилерскийЦентр = ФактическоеВремя.ДилерскийЦентр
		|			И ТаблицаДанных.РабочийДокумент = ФактическоеВремя.РабочийДокумент
		|			И ТаблицаДанных.Цех = ФактическоеВремя.Цех
		|			И ТаблицаДанных.ЭтапРабот = ФактическоеВремя.ЭтапРабот
		|			И ТаблицаДанных.Обращение = ФактическоеВремя.Обращение";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДанных = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДанных.Следующий() Цикл
		
		Если ВыборкаДанных.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована Тогда
			
			СтруктураЗаписиРегистра = Новый Структура("Период,ДилерскийЦентр,Обращение,РабочийДокумент,Цех,ЭтапРабот,СтатусРаботы");
			ЗаполнитьЗначенияСвойств(СтруктураЗаписиРегистра,ВыборкаДанных);
			СтруктураЗаписиРегистра.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаПросрочена;
			
			ДобавитьЗаписьВРегистрСведений(СтруктураЗаписиРегистра,"Renault_АвтосервисСтатусыРабот");	
			
		КонецЕсли; 
		
		ЗаписатьНезаконченнуюРаботу(ВыборкаДанных,ШагПланирования);
		
	КонецЦикла;
	
	ОбработатьСтатусы(ШагПланирования);
	
	ЗавершитьРаботыБезПлана();
	
КонецПроцедуры

// БурковскийМЕ от 18.10.19 {
// обновляет и ставит просроченные статусы у работ которые запланированы и просрочены
Процедура Обновить_DMS_АРМ_АВтосервис() Экспорт
	Период 			= ТекущаяДатаСеанса();
	ШагПланирования	= 60;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочийПериод", НачалоДня(Период));
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("СтатусЗапланирована", Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	DMS_АРМ_Автосервис.ДилерскийЦентр,
		|	DMS_АРМ_Автосервис.РабочийПериод,
		|	DMS_АРМ_Автосервис.Обращение,
		|	DMS_АРМ_Автосервис.РабочийДокумент,
		|	DMS_АРМ_Автосервис.ЭтапРабот,
		|	DMS_АРМ_Автосервис.ВремяНачалаРег,
		|	DMS_АРМ_Автосервис.ВремяОкончанияРег,
		|	DMS_АРМ_Автосервис.Статус,
		|	DMS_АРМ_Автосервис.Цех
		|ИЗ
		|	РегистрСведений.DMS_АРМ_Автосервис КАК DMS_АРМ_Автосервис
		|ГДЕ
		|	DMS_АРМ_Автосервис.РабочийПериод = &РабочийПериод
		|	И DMS_АРМ_Автосервис.Статус = &СтатусЗапланирована
		|	И DMS_АРМ_Автосервис.ВремяНачалаРег < &Период";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДанных = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДанных.Следующий() Цикл
		
		Если ВыборкаДанных.Статус = Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована Тогда
			
			//СтруктураЗаписиРегистра = Новый Структура("ДилерскийЦентр, РабочийПериод, Обращение,РабочийДокумент,Цех,ЭтапРабот,Статус");
			//ЗаполнитьЗначенияСвойств(СтруктураЗаписиРегистра,ВыборкаДанных);
			//СтруктураЗаписиРегистра.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаПросрочена;
			// изменим регистр сведений АРМ_АВтосервис
			
			НаборЗаписей = РегистрыСведений.DMS_АРМ_Автосервис.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДилерскийЦентр.Установить(ВыборкаДанных.ДилерскийЦентр);
			НаборЗаписей.Отбор.РабочийПериод.Установить(ВыборкаДанных.РабочийПериод);
			НаборЗаписей.Отбор.Обращение.Установить(ВыборкаДанных.Обращение);
			НаборЗаписей.Отбор.ЭтапРабот.Установить(ВыборкаДанных.ЭтапРабот);
			НаборЗаписей.Отбор.РабочийДокумент.Установить(ВыборкаДанных.РабочийДокумент);
			НаборЗаписей.Прочитать();	
			Если НаборЗаписей.Количество()= 1 Тогда
				запись = НаборЗаписей[0];
				Запись.Статус = Справочники.Renault_СтатусыАвторабот.РаботаПросрочена; //Справочники.Renault_СтатусыАвторабот.РаботаЗакончена
				НаборЗаписей.Записать(Истина);
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;

КонецПроцедуры
// БурковскийМЕ от 18.10.19 }

// Добавляет одну запись в регистр сведений по переданным значениям структуры.
//
// Параметры:
//  СтруктураЗаписи - Структура - структура, по значениям которой необходимо создать набор записей и заполнить этот
//                                набор.
//  ИмяРегистра     - Строка - имя регистра сведений, в который необходимо добавить запись.
// 
Процедура ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, Знач ИмяРегистра, СтруктураОтбора = Неопределено, Загрузка = Ложь) Экспорт
	
	Если СтруктураОтбора = Неопределено Тогда
		НаборЗаписей = СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, ИмяРегистра);
	Иначе 
		НаборЗаписей = СоздатьНаборЗаписейРегистраСведений(СтруктураОтбора, ИмяРегистра);
	КонецЕсли; 

	// Добавляем только одну запись в новый набор записей.
	НоваяЗапись = НаборЗаписей.Добавить();
	
	// Заполняем значения свойств записи из переданной структуры.
	ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
	
	НаборЗаписей.ОбменДанными.Загрузка = Загрузка;
	
	// записываем набор записей
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Создает набор записей регистра сведений по переданным значениям структуры. Добавляет одну запись в набор.
//
// Параметры:
//  СтруктураЗаписи - Структура - структура по значениям которой необходимо создать набор записей и заполнить этот
//                                набор.
//  ИмяРегистра     - Строка - имя регистра сведений.
// 
Функция СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, ИмяРегистра) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра];
										  
	// Создаем набор записей регистра.
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	
	Если МетаданныеРегистра.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда		
		НаборЗаписей.Отбор["Период"].Установить(СтруктураЗаписи["Период"]);
	КонецЕсли; 
	
	// Устанавливаем отбор по измерениям регистра.
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		// Если задано значение в структуре, то отбор устанавливаем.
		Если СтруктураЗаписи.Свойство(Измерение.Имя) Тогда
			НаборЗаписей.Отбор[Измерение.Имя].Установить(СтруктураЗаписи[Измерение.Имя]);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НаборЗаписей;
	
КонецФункции

Процедура ЗаписатьНезаконченнуюРаботу(ВыборкаДанных,ШагПланирования)
	
	Если ВыборкаДанных.Период > ВыборкаДанных.КонецРабочегоДняДЦ Тогда
		ЗаписатьНачатуюНезавершеннуюРаботу(ВыборкаДанных);
	Иначе 
		
		ФактВремени = ВыборкаДанных.ФактВремени;
		
		ТипРабочегоДокумента = ТипЗнч(ВыборкаДанных.РабочийДокумент);
		
		Если ТипРабочегоДокумента = Тип("ДокументСсылка.Renault_CRM_ВыдачаАвтомобиля") Тогда
			
			Если ФактВремени/60 >= ВыборкаДанных.ДлительностьВыдачи + ВыборкаДанных.ЗавершатьВыдачуЧерез Тогда
				ЗаписатьНачатуюНезавершеннуюРаботу(ВыборкаДанных);
			КонецЕсли;                              
			
		ИначеЕсли ТипРабочегоДокумента = Тип("ДокументСсылка.Renault_CRM_ПриемкаАвтомобиля") Тогда
			
			Если ФактВремени/60 >= ВыборкаДанных.ДлительностьПриемки + ВыборкаДанных.ЗавершатьПриемкуЧерез Тогда
				ЗаписатьНачатуюНезавершеннуюРаботу(ВыборкаДанных);
			КонецЕсли;
			
		КонецЕсли;	
		
		//нужно проверить, возможно из-за этого проблема в РЗ
		Если ВыборкаДанных.НеДвигатьПросроченныеРаботы 
			И ВыборкаДанных.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаПросрочена Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ЗаписатьОперативныйПланПоНезавершеннойРаботе(ВыборкаДанных,ФактВремени,ШагПланирования);			
		
	КонецЕсли; 
	
КонецПроцедуры   

Процедура ЗаписатьОперативныйПланПоНезавершеннойРаботе(ВыборкаДанных,ФактВремени,ШагПланирования)

	СтруктураЗаписиРегистра = Новый Структура("Период,ДилерскийЦентр,Обращение,РабочийДокумент,Цех,ЭтапРабот");	
	
	ЗаполнитьЗначенияСвойств(СтруктураЗаписиРегистра,ВыборкаДанных);
	
	СтруктураЗаписиРегистра.Вставить("ВремяНачала", ВыборкаДанных.Период);	
	
	ТекущийКонецРабочегоДня = ВыборкаДанных.КонецРабочегоДняДЦ; // конец текущего раб.дня
	
	ИнтервалМеждуРабочимиДнями = Справочники.CRM_ДилерскиеЦентры.ПолучитьНачалоРабочегоДняАвтосервиса(ВыборкаДанных.ДилерскийЦентр, (ВыборкаДанных.Период + 86400)) - ВыборкаДанных.КонецРабочегоДняДЦ; // Интервал между концом текущего и началом следующего раб.дня
	
	Длительность = ВыборкаДанных.Длительность*3600 - ФактВремени;
	
	СтруктураЗаписиРегистра.Вставить("ВремяОкончания", ВыборкаДанных.Период + Длительность);	
	
	ПерезаписатьВремяОкончания = Истина;
	
	Индекс = 1;
	
	Пока СтруктураЗаписиРегистра.ВремяОкончания > ТекущийКонецРабочегоДня Цикл
		
		ПерезаписатьВремяОкончания = Ложь;
		
		СтруктураЗаписиРегистра.ВремяОкончания = СтруктураЗаписиРегистра.ВремяОкончания + ИнтервалМеждуРабочимиДнями;
		
		ТекущийКонецРабочегоДня = Справочники.CRM_ДилерскиеЦентры.ПолучитьКонецРабочегоДняАвтосервиса(ВыборкаДанных.ДилерскийЦентр, (ВыборкаДанных.Период + Индекс*86400)); // Конец следующего раб.дня
		
		ИнтервалМеждуРабочимиДнями = Справочники.CRM_ДилерскиеЦентры.ПолучитьНачалоРабочегоДняАвтосервиса(ВыборкаДанных.ДилерскийЦентр, (ВыборкаДанных.Период + (Индекс+1)*86400)) - ТекущийКонецРабочегоДня;
		
		Индекс = Индекс + 1;
		
	КонецЦикла; 
	
	Если ПерезаписатьВремяОкончания Тогда
		
		Если Длительность < 0 Тогда
			СтруктураЗаписиРегистра.ВремяОкончания = ВыборкаДанных.Период + ШагПланирования;
		Иначе
			СтруктураЗаписиРегистра.ВремяОкончания = ВыборкаДанных.Период + Длительность;
		КонецЕсли;
		
	КонецЕсли; 
	
	СтруктураЗаписиРегистра.Вставить("Длительность", Длительность/3600);
	
	ДобавитьЗаписьВРегистрСведений(СтруктураЗаписиРегистра,"Renault_АвтосервисПланОперативный");
	
КонецПроцедуры

Процедура ЗаписатьНачатуюНезавершеннуюРаботу(ВыборкаДанных)

	СтруктураЗаписиРегистра = Новый Структура("Период,ДилерскийЦентр,Обращение,РабочийДокумент,Цех,ЭтапРабот");	
	
	ЗаполнитьЗначенияСвойств(СтруктураЗаписиРегистра,ВыборкаДанных);
	
	СтруктураЗаписиРегистра.Вставить("ДатаВремяИзменения",ВыборкаДанных.Период);
	
	ТипРабочегоДокумента = ТипЗнч(ВыборкаДанных.РабочийДокумент);
	
	Если ТипРабочегоДокумента = Тип("ДокументСсылка.Renault_CRM_ПриемкаАвтомобиля") Тогда
		
		СтруктураЗаписиРегистра.Вставить("СтатусРаботы",Справочники.Renault_СтатусыАвторабот.РаботаЗакончена);
		
		РабочийДокументОбъект = ВыборкаДанных.РабочийДокумент.ПолучитьОбъект();
		РабочийДокументОбъект.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен;
		
		Попытка
			
			Если РабочийДокументОбъект.Проведен Тогда
				РабочийДокументОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			Иначе 
				РабочийДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли; 
			
		Исключение
			
			ЗаписьЖурналаРегистрации("Запись документа: "+СокрЛП(ВыборкаДанных.РабочийДокумент),УровеньЖурналаРегистрации.Ошибка,,ВыборкаДанных.РабочийДокумент,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));;
			
			ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			
			Возврат;
			
		КонецПопытки;
		
	ИначеЕсли ВыборкаДанных.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаНачата 
		И ТипРабочегоДокумента = Тип("ДокументСсылка.Renault_CRM_ВыдачаАвтомобиля") Тогда 
		
		СтруктураЗаписиРегистра.Вставить("СтатусРаботы",Справочники.Renault_СтатусыАвторабот.РаботаЗакончена);
		
		РабочийДокументОбъект = ВыборкаДанных.РабочийДокумент.ПолучитьОбъект();
		РабочийДокументОбъект.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен;
		
		Попытка
			
			Если РабочийДокументОбъект.Проведен Тогда
				РабочийДокументОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			Иначе 
				РабочийДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли; 
			
		Исключение
			
			ЗаписьЖурналаРегистрации("Запись документа: "+СокрЛП(ВыборкаДанных.РабочийДокумент),УровеньЖурналаРегистрации.Ошибка,,ВыборкаДанных.РабочийДокумент,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));;
			
			ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			
			Возврат;
			
		КонецПопытки;
		
	ИначеЕсли ТипРабочегоДокумента = Тип("ДокументСсылка.Renault_CRM_ЗаявкаНаПодменныйАвто") Тогда
		
		СтруктураЗаписиРегистра.Вставить("СтатусРаботы", ВыборкаДанных.СтатусРаботы);
		
	ИначеЕсли ЗначениеЗаполнено(ВыборкаДанных.ОбращениеРабочийДокумент) Тогда
		
		Если ВыборкаДанных.ИгнорироватьНезакрытуюВыдачу Тогда
			
			СтруктураЗаписиРегистра.Вставить("СтатусРаботы", Справочники.Renault_СтатусыАвторабот.РаботаЗакончена);
			
		Иначе 
			
			ВыдачаАвтомобиля = ПолучитьВыдачуАвтомобиляПоОбращению(ВыборкаДанных.ОбращениеРабочийДокумент);
			
			Если ЗначениеЗаполнено(ВыдачаАвтомобиля) Тогда
				СтруктураЗаписиРегистра.Вставить("СтатусРаботы", Справочники.Renault_СтатусыАвторабот.РаботаЗакончена);
			Иначе 
				СтруктураЗаписиРегистра.Вставить("СтатусРаботы", Справочники.Renault_СтатусыАвторабот.РаботаПауза);
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если СтруктураЗаписиРегистра.Свойство("СтатусРаботы") Тогда
		ДобавитьЗаписьВРегистрСведений(СтруктураЗаписиРегистра,"Renault_АвтосервисСтатусыРабот");
	КонецЕсли; 
	
КонецПроцедуры

Функция ПолучитьВыдачуАвтомобиляПоОбращению(Обращение)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Обращение", Обращение);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ВыдачаАвтомобиля.Ссылка
		|ИЗ
		|	Документ.Renault_CRM_ВыдачаАвтомобиля КАК ВыдачаАвтомобиля
		|ГДЕ
		|	ВыдачаАвтомобиля.Обращение = &Обращение
		|	И НЕ ВыдачаАвтомобиля.ПометкаУдаления
		|	И ВыдачаАвтомобиля.Состояние = ЗНАЧЕНИЕ(Справочник.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыдачаАвтомобиля = Документы.Renault_CRM_ВыдачаАвтомобиля.ПустаяСсылка();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ВыдачаАвтомобиля = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли; 
	
	Возврат ВыдачаАвтомобиля;
	
КонецФункции // ПолучитьВыдачуАвтомобиляПоОбращению()
 
Процедура ОбработатьСтатусы(ШагПланирования)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АвтосервисСтатусыРабот.Период КАК Период,
		|	АвтосервисСтатусыРабот.ДилерскийЦентр КАК ДилерскийЦентр,
		|	АвтосервисСтатусыРабот.Цех КАК Цех,
		|	АвтосервисСтатусыРабот.РабочийДокумент КАК РабочийДокумент,
		|	АвтосервисСтатусыРабот.ДатаВремяИзменения КАК ДатаВремяИзменения,
		|	АвтосервисСтатусыРабот.СтатусРаботы КАК СтатусРаботы,
		|	АвтосервисСтатусыРабот.Обращение КАК Обращение,
		|	АвтосервисСтатусыРабот.ЭтапРабот КАК ЭтапРабот,
		|	ЕСТЬNULL(АвтосервисФактОперативный.ВремяОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК ВремяОкончания,
		|	&Период КАК ТекущийПериод
		|ИЗ
		|	РегистрСведений.Renault_АвтосервисСтатусыРабот.СрезПоследних(&Период, ) КАК АвтосервисСтатусыРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисФактОперативный.СрезПоследних(&Период, ) КАК АвтосервисФактОперативный
		|		ПО (АвтосервисФактОперативный.РабочийДокумент = АвтосервисСтатусыРабот.РабочийДокумент)
		|			И (АвтосервисФактОперативный.ЭтапРабот = АвтосервисСтатусыРабот.ЭтапРабот)
		|			И (АвтосервисСтатусыРабот.Цех <> НЕОПРЕДЕЛЕНО)
		|			И (АвтосервисСтатусыРабот.Цех <> ЗНАЧЕНИЕ(Справочник.Renault_CRM_Мойки.пустаяСсылка))
		|			И (АвтосервисСтатусыРабот.Цех <> ЗНАЧЕНИЕ(Справочник.Renault_CRM_ПодменныеАвто.пустаяСсылка))
		|			И (АвтосервисСтатусыРабот.Цех <> ЗНАЧЕНИЕ(Справочник.Сотрудники.пустаяСсылка))
		|			И (АвтосервисСтатусыРабот.Цех <> ЗНАЧЕНИЕ(Справочник.Цеха.пустаяСсылка))
		|ГДЕ
		|	АвтосервисСтатусыРабот.СтатусРаботы = ЗНАЧЕНИЕ(Справочник.Renault_СтатусыАвторабот.РаботаНачата)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДанных = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДанных.Следующий() Цикл
		ЗаписатьФактОперативный(ВыборкаДанных, ШагПланирования);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьФактОперативный(ВыборкаДанных,ШагПланирования)
	
	//Если Макс(ВыборкаДанных.ВремяОкончания, ВыборкаДанных.ТекущийПериод) - Мин(ВыборкаДанных.ВремяОкончания, ВыборкаДанных.ТекущийПериод) < ШагПланирования Тогда
		
		Набор = РегистрыСведений.Renault_АвтосервисФактОперативный.СоздатьНаборЗаписей();
		Набор.Отбор.Обращение.Установить(ВыборкаДанных.Обращение);
		Набор.Отбор.РабочийДокумент.Установить(ВыборкаДанных.РабочийДокумент);
		Набор.Отбор.Цех.Установить(ВыборкаДанных.Цех);
		Набор.Отбор.ЭтапРабот.Установить(ВыборкаДанных.ЭтапРабот);
		Набор.Прочитать();
		
		Если Набор.Количество()>0 Тогда
			Для Каждого Запись ИЗ Набор Цикл
				
				Если Запись.ВремяОкончания = ВыборкаДанных.ВремяОкончания Тогда
					Запись.Период = ВыборкаДанных.ТекущийПериод;
					Запись.ВремяОкончания = ВыборкаДанных.ТекущийПериод + ШагПланирования;
				КонецЕсли;
				
			КонецЦикла;
			
			Набор.Записать();
			
		Иначе
					
			Запись = РегистрыСведений.Renault_АвтосервисФактОперативный.СоздатьМенеджерЗаписи();
			Запись.ДилерскийЦентр 	= ВыборкаДанных.ДилерскийЦентр;
			Запись.РабочийДокумент 	= ВыборкаДанных.РабочийДокумент;
			Запись.Цех 				= ВыборкаДанных.Цех;
			Запись.ВремяНачала 		= ВыборкаДанных.ТекущийПериод;
			Запись.Период 			= ВыборкаДанных.ТекущийПериод;
			Запись.ВремяОкончания 	= ВыборкаДанных.ТекущийПериод + ШагПланирования;
			Запись.ЭтапРабот 		= ВыборкаДанных.ЭтапРабот;
			Запись.Обращение 		= ВыборкаДанных.Обращение;
			Запись.Записать();
			
		КонецЕсли;
	
КонецПроцедуры

Процедура ЗавершитьРаботыБезПлана()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АвтосервисФактОперативный.РабочийДокумент КАК РабочийДокумент,
		|	АвтосервисСтатусыРабот.СтатусРаботы,
		|	АвтосервисФактОперативный.Обращение,
		|	АвтосервисФактОперативный.ДилерскийЦентр,
		|	АвтосервисФактОперативный.ЭтапРабот,
		|	АвтосервисФактОперативный.Цех,
		|	АвтосервисПланРабот.РабочийДокумент КАК ДокументПлан
		|ИЗ
		|	РегистрСведений.Renault_АвтосервисФактОперативный.СрезПоследних КАК АвтосервисФактОперативный
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисСтатусыРабот.СрезПоследних КАК АвтосервисСтатусыРабот
		|		ПО АвтосервисФактОперативный.ДилерскийЦентр = АвтосервисСтатусыРабот.ДилерскийЦентр
		|			И АвтосервисФактОперативный.Обращение = АвтосервисСтатусыРабот.Обращение
		|			И АвтосервисФактОперативный.РабочийДокумент = АвтосервисСтатусыРабот.РабочийДокумент
		|			И АвтосервисФактОперативный.ЭтапРабот = АвтосервисСтатусыРабот.ЭтапРабот
		|			И АвтосервисФактОперативный.Цех = АвтосервисСтатусыРабот.Цех
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_АвтосервисПланРабот КАК АвтосервисПланРабот
		|		ПО АвтосервисФактОперативный.ДилерскийЦентр = АвтосервисПланРабот.ДилерскийЦентр
		|			И АвтосервисФактОперативный.Обращение = АвтосервисПланРабот.Обращение
		|			И АвтосервисФактОперативный.РабочийДокумент = АвтосервисПланРабот.РабочийДокумент
		|			И АвтосервисФактОперативный.ЭтапРабот = АвтосервисПланРабот.ЭтапРабот
		|			И АвтосервисФактОперативный.Цех = АвтосервисПланРабот.Цех
		|ГДЕ
		|	АвтосервисПланРабот.РабочийДокумент ЕСТЬ NULL ";
				   
				   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений.Renault_АвтосервисФактОперативный.СоздатьНаборЗаписей();
					
		Набор.Отбор.Обращение.Установить(Выборка.Обращение);
		Набор.Отбор.РабочийДокумент.Установить(Выборка.РабочийДокумент);
		Набор.Отбор.Цех.Установить(Выборка.Цех);
		Набор.Отбор.ЭтапРабот.Установить(Выборка.ЭтапРабот);
					
		Набор.Прочитать();
		Набор.Очистить();
		Набор.Записать();
		
		Набор = РегистрыСведений.Renault_АвтосервисПланОперативный.СоздатьНаборЗаписей();
					
		Набор.Отбор.Обращение.Установить(Выборка.Обращение);
		Набор.Отбор.РабочийДокумент.Установить(Выборка.РабочийДокумент);
		Набор.Отбор.Цех.Установить(Выборка.Цех);
		Набор.Отбор.ЭтапРабот.Установить(Выборка.ЭтапРабот);
					
		Набор.Прочитать();
		Набор.Очистить();
		Набор.Записать();
		
		Набор = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьНаборЗаписей();
					
		Набор.Отбор.Обращение.Установить(Выборка.Обращение);
		Набор.Отбор.РабочийДокумент.Установить(Выборка.РабочийДокумент);
		Набор.Отбор.Цех.Установить(Выборка.Цех);
		Набор.Отбор.ЭтапРабот.Установить(Выборка.ЭтапРабот);
					
		Набор.Прочитать();
		Набор.Очистить();
		Набор.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОчиститьИзбыточныеДанные()
	
	ВыборкаДЦ = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	
	МожноПриступать = Истина;
	
	Пока ВыборкаДЦ.Следующий() Цикл
		
		ТекущийКонецРабочегоДня = Справочники.CRM_ДилерскиеЦентры.ПолучитьКонецРабочегоДняАвтосервиса(ВыборкаДц.Ссылка, ТекущаяДата());
		
		Если ЗначениеЗаполнено(ТекущийКонецРабочегоДня) И ТекущийКонецРабочегоДня + 180 < ТекущаяДата() Тогда
			
		Иначе
			
			МожноПриступать = Ложь;
			Возврат;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Если МожноПриступать Тогда
		
		ОчиститьПланОперативный();
		
		УдалитьРегистры();
		
	КонецЕсли;	
		
КонецПроцедуры

Процедура ОчиститьПланОперативный()
	
	Запрос = Новый Запрос ("ВЫБРАТЬ
	         |	Renault_АвтосервисСтатусыРаботСрезПоследних.СтатусРаботы,
	         |	Renault_АвтосервисСтатусыРаботСрезПоследних.Обращение,
	         |	Renault_АвтосервисСтатусыРаботСрезПоследних.РабочийДокумент
	         |ИЗ
	         |	РегистрСведений.Renault_АвтосервисСтатусыРабот.СрезПоследних КАК Renault_АвтосервисСтатусыРаботСрезПоследних
	         |ГДЕ
	         |	Renault_АвтосервисСтатусыРаботСрезПоследних.СтатусРаботы = &СтатусРаботы");
			 
	Запрос.УстановитьПараметр("СтатусРаботы", Справочники.Renault_СтатусыАвторабот.РаботаЗакончена);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		
		Набор = РегистрыСведений.Renault_АвтосервисПланОперативный.СоздатьНаборЗаписей();
		Набор.Отбор.РабочийДокумент.Значение = Выборка.РабочийДокумент;
		Набор.Отбор.РабочийДокумент.Использование = Истина;
		
		Набор.Прочитать();
		
		Набор.Очистить();
		
		Набор.Записать();
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура УдалитьПустыеСтатусы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.Renault_АвтосервисСтатусыРабот КАК Renault_АвтосервисСтатусыРабот
	               |ГДЕ
	               |	Renault_АвтосервисСтатусыРабот.СтатусРаботы = &СтатусРаботы";
				   
	Запрос.УстановитьПараметр("СтатусРаботы", Справочники.Renault_СтатусыАвторабот.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьМенеджерЗаписи();
					
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		Запись.Прочитать();
		
		Если Запись.Выбран() Тогда
			
			Запись.Удалить();
			
			Сообщить(Строка(Выборка.Рабочийдокумент) + " " + Строка(Выборка.ЭтапРабот) + " " + Строка(Выборка.СтатусРаботы) + " удален.");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НайтиИУдалитьЛишниеСтатусы(РабочийДокумент, Этап)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.Renault_АвтосервисСтатусыРабот КАК Renault_АвтосервисСтатусыРабот
	               |ГДЕ
	               |	Renault_АвтосервисСтатусыРабот.СтатусРаботы <> &СтатусРаботы
	               |	И Renault_АвтосервисСтатусыРабот.РабочийДокумент = &РабочийДокумент
	               |	И Renault_АвтосервисСтатусыРабот.ЭтапРабот = &ЭтапРабот
	               |	И Renault_АвтосервисСтатусыРабот.СтатусРаботы <> &Запланирована";
				   
	Запрос.УстановитьПараметр("РабочийДокумент", РабочийДокумент);
	Запрос.УстановитьПараметр("ЭтапРабот", Этап);
	Запрос.УстановитьПараметр("СтатусРаботы", Справочники.Renault_СтатусыАвторабот.РаботаЗакончена);
	Запрос.УстановитьПараметр("Запланирована", Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьМенеджерЗаписи();
					
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		Запись.Прочитать();
		
		Если Запись.Выбран() Тогда
			
			Запись.Удалить();
			
			Сообщить(Строка(Выборка.Рабочийдокумент) + " " + Строка(Выборка.ЭтапРабот) + " " + Строка(Выборка.СтатусРаботы) + " удален.");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьРегистры()
	
	УдалитьПустыеСтатусы();
		
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_АвтосервисСтатусыРабот.СтатусРаботы,
	               |	Renault_АвтосервисСтатусыРабот.ЭтапРабот,
	               |	Renault_АвтосервисСтатусыРабот.РабочийДокумент
	               |ИЗ
	               |	РегистрСведений.Renault_АвтосервисСтатусыРабот КАК Renault_АвтосервисСтатусыРабот
	               |ГДЕ
	               |	Renault_АвтосервисСтатусыРабот.СтатусРаботы = &СтатусРаботы
	               |	И Renault_АвтосервисСтатусыРабот.Период < &Период";
				   
				   
	Запрос.УстановитьПараметр("СтатусРаботы", Справочники.Renault_СтатусыАвторабот.РаботаЗакончена);
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		 НайтиИУдалитьЛишниеСтатусы(Выборка.РабочийДокумент, Выборка.ЭтапРабот);
		
	КонецЦикла;
	
КонецПроцедуры
